{
  "docs": [
    {
      "id": "7300e347-1bc0-4971-9735-81f44cf6b1c2",
      "name": "Syllabus_CSI4999.pdf",
      "createdAt": "2025-10-13T21:59:36.516Z",
      "chunkCount": 4,
      "chunks": [
        {
          "id": 0,
          "text": "SYLLABUS\n\n                                    Oakland University\n\n                  School of Engineering and Computer Science\n\n              Department of Computer Science and Engineering\n\n                                           CSI 4999\n\n                                Senior Capstone Project\n\nCOURSE INFORMATION\n\n       Course Format: HyFlex (students can attend the class either in-person or online. I will post\n       the link to the zoom meetings for each class on Moodle)\n\n        Day/Time: Mondays-Wednesdays 5:30-7:17 pm\n\n        Semester/Year: Fall 2025\n\n        Class Location: O’Dowd Hall\n\n        Professor: Reyhaneh Gamasaee\n\n        Email: gamasaee@oakland.edu\n\n        Office hours: Mondays-Wednesdays 7:20-8:00 pm. Please send me an email to schedule\n       an appointment with you.\n\nSpecific course information\n\nTeam oriented senior project to synthesize the knowledge and skills gained in the CS/IT\n\ncurricula. Written and oral reports are required in addition to working demonstration.\n\nPrerequisites: CSI 3640, CSI 3370, CSI 3450. Requires a major standing\n\nRequired course for CS and IT major\nCourse Objectives: Upon successful completion of this course, students should be able to\n\n• Demonstrate an ability to apply knowledge of mathematics, science, and engineering [ABET\n\nCS: (a), IT: (a)]\n\n• Demonstrate an ability to design and conduct experiments, as well as to analyze and interpret\n\ndata [ABET CS: (b), IT: (b)]\n\n• Demonstrate an ability to design a system, component, or process to meet desired needs\n\nwithin realistic constraints such as economic, environmental, social, political, ethical, health\n\nand safety, manufacturability, and sustainability [ABET CS: (c), IT: (c, k, m, n)]\n\n• Demonstrate an ability to function on multidisciplinary teams [ABET CS: (d), IT: (d)]\n\n• Demonstrate an ability to identify, formulate, and solve engineering problems [ABET CS: (j,\n\nk), IT: (j, l)]\n\n• Demonstrate an understanding of professional and ethical responsibility [ABET CS: (e), IT:\n\n(e)]\n\n• Demonstrate an ability to communicate effectively [ABET CS: (f), IT: (f)]\n\n• Demonstrate the broad education necessary to understand the impact of engineering solutions\n\nin a global, economic, environmental, and societal context [ABET CS: (g), IT: (g)]\n\n• Demonstrate a recognition of the need for, and an ability to engage in lifelong learning\n\n[ABET CS: (h), IT: (h)]\n\n• Demonstrate a knowledge of contemporary issues [ABET CS: (e), IT: (e)]\n\n• Demonstrate an ability to use the techniques, skills, and modern engineering tools necessary\n\nfor engineering practice [ABET CS: (i), IT: (i)]\nGRADING\n\nThe final grade for this course is based on the following weights:\n\nHomework assignments 20%\n\nMilestone 1               10%\n\nMilestone 2               20%\n\nMilestone 3               25%\n\nMilestone 4               25%\n\n\n\nHOMEWORK ASSIGNMENTS\n\nAll assignments will be posted on Moodle and students need to turn them in via Moodle.\n\nPoints"
        },
        {
          "id": 1,
          "text": "20%\n\nMilestone 3               25%\n\nMilestone 4               25%\n\n\n\nHOMEWORK ASSIGNMENTS\n\nAll assignments will be posted on Moodle and students need to turn them in via Moodle.\n\nPoints for each assignment will vary based on difficulty, but will average out to comprise 20% of\nyour final grade.\n\nNOTE: Some assignments must be completed individually, while others may be submitted with\nyour group (e.g., status reports).\n\n\n\nHOMEWORK EXTENSION: You can request one extension on any homework assignment.\nStudents are expected to send me an email if they want to use this extension for one of their\nassignments.\n\nLATE POLICY: Homework assignments may be submitted late. 10% will be deducted for late\nsubmission.\n\nMILESTONES 1-4\n\nProjects will be completed in groups of 3–5 people. The project will be worth 80% of your grade,\ndivided into 4 milestones as outlined above. Along with the milestones, students will evaluate the\nparticipation of their group members. The group evaluations will significantly impact the grade\nreceived.\n\nLATE POLICY: Late submissions for any milestone will NOT be accepted.\n\nNOTE: Each team member should contribute an equal amount of effort in both technical and\ndocumentation efforts, and that the final documentation and presentation include a detailed\ndescription of the tasks each team member accomplished.\n\nFor example, it will be unacceptable for one person to do the documentation and the other to do\nall the technical work.\n\nTENTATIVE MILESTONE DUE DATES\n\n1. Milestone 1: May 28th\n\n2. Milestone 2: Jun 18th\n\n3. Milestone 3: July 14th\n\n4. Milestone 4: August 11th\n\nCLASS POLICIES\n\n• Class attendance: I will not be taking attendance. You do not need to email me if you are unable\nto attend a lecture. It is up to you to coordinate tasks with your group members.\n\n• Moodle: All course materials (lecture notes, assignments, etc.) will be posted to Moodle as they\nbecome available. Students are expected to check Moodle regularly for course updates. All\nhomework assignments are to be submitted through Moodle by the specified date and time. It is\nthe student’s responsibility to upload assignments correctly and in the event of the student’s\nfailure to do so, the policies in this syllabus will be explicitly followed.\n\n• Technology back-up plan: In the event that your computer crashes or Internet goes down, it is\nessential to have a “backup plan” in place where you are able to log in using a different computer\nor travel another location that has working Internet.\nAny files you intend to use for your course should be saved to a cloud solution (free solutions as\nan OU student include Google Drive, Microsoft OneDrive, etc.) and not to a local hard drive, USB\nstick or external disk. Saving files this way guarantees your files are not dependent on computer\nhardware that could fail.\n\n• Add/Drops: The university policy will be explicitly followed. It is the student’s responsibility to\nbe aware of deadline dates for dropping courses.\n\nCHEATING AND"
        },
        {
          "id": 2,
          "text": "computer\nhardware that could fail.\n\n• Add/Drops: The university policy will be explicitly followed. It is the student’s responsibility to\nbe aware of deadline dates for dropping courses.\n\nCHEATING AND PLAGIARISM\n\n1. Cooperation and cheating: For assignments to be completed individually, do not copy\n    answers from each other, as cheating is not tolerated. Furthermore, do not copy any code\n    from an online resource. Any instances of cheating or plagiarism will be reported to the\n    university/Dean of Students and you will likely lose credit for the course. If you are found to\n    be cheating or plagiarizing, you will receive a grade of 0 and will most likely fail the course.\n    Please    read     the    Academic      Conduct      Regulations     for    more     information\n    (https://www.oakland.edu/deanofstudents/policies).\n\n2. Special Note on AI: The use of generative Artificial Intelligence (AI) assistant tools (e.g.,\nChatGPT, Bard, etc.) have become commonplace today. While these tools can be an effective way\nto check the quality of your written work, prompt new ideas, or generate simplified explanations\nof complex topics to support your learning, they DO NOT replace original thought and can often\nbe biased, incorrect, or hallucinate references that do not exist, ultimately impeding learning.\nTherefore, it is very important that you adhere to the following guidelines:\n\n(a) As with any scholarly writing, references are required. This is no different for generative AI. If\nyou use a generative AI tool, you must cite it, including the specific AI tool, a description of\nhow/why you decided to use it, and the full transcript (i.e., the prompts you used and the output).\nAny uncited use of generative AI will be considered plagiarism as described above.\n\n(b) You are responsible for what you submit. Use your engineering judgement to rigorously\nunderstand and evaluate anything created using generative AI. You should be able to fully explain\nanything that you submit.\n(c) Your goal is to learn. Therefore, work (including writing, code, images, or any other portion of\na graded assignment) created directly from generative AI may not be submitted as your own and\nwill be treated as plagiarism. Assignments suspected to be taken directly from a generative AI\ntool will be treated as academic misconduct and referred to the Dean of Students.\n\n(d) If you have any doubts about this policy, ask the instructor BEFORE submitting an assignment\nthat uses any form of generative AI.\n\n3. Academic pledge: In order to uphold academic conduct standards at Oakland University, all\nstudents must act according to the pledge below.\n\n(a) I pledge that all my work in the course, including but not limited to, my assignments, tests,\nand examinations, are my own work and I have received no unauthorized assistance or\ncollaboration.\n\n(b) I understand that if I am unclear about the appropriate or allowable use of any support\nmaterials to complete my required coursework, I will contac"
        },
        {
          "id": 3,
          "text": "ed no unauthorized assistance or\ncollaboration.\n\n(b) I understand that if I am unclear about the appropriate or allowable use of any support\nmaterials to complete my required coursework, I will contact the faculty for clarification before\nusing said materials.\n\n(c) I understand that all alleged violations of academic misconduct will be reported to the\nAcademic Conduct Committee. If found responsible for violations of academic misconduct, I will\nbe subject to disciplinary measures by the university up to and possibly including expulsion\n(permanent separation) from the university."
        }
      ]
    }
  ]
}